[
  {
    "id": "cs-371p-intro",
    "title": "CS 371p Spring 2026: Alex Hoang",
    "date": "2026-01-19",
    "excerpt": "Hi everyone, my name is Alexander Hoang and I'm a senior at UT about to graduate with a degree in Computer Science.",
    "content": "Hi everyone, my name is Alexander Hoang and I'm a senior at UT and am about to graduate with a degree in Computer Science. I was born in Boston, MA and moved to Rockwall, TX at a young age. I went to Rockwall High School and competed on the tennis team and played cello in the orchestra.\n\n![On a cruise in Milford Sound, New Zealand](/milford-sound.JPG)\n\n## Where would you have gone if UT hasn't accepted you?\n\nI probably would have gone to UT Dallas to save money since my home is close to there.\n\n## What would you have majored in if CS hadn't accepted you?\n\nI have always been interested in computing and would have chosen to major in UT's Electrical and Computer Engineering (ECE) major.\n\n## Why are you in this class?\n\nI'm in this class as this is one of my final classes I need to graduate from UT and fulfills one of my 8 CS upper division elective courses.\n\n## What are your expectations of this class?\n\nMy expectations of this class is that I will be expected to work hard, be diligent, and apply myself in my studies. There are a lot of assignments and a very specific structure that professor Downing has made this class to be.\n\n## How much C/C++ do you already know?\n\nI know a little bit of C++ through some endeavors in high school but haven't touched it since. And for C, I only know what was used in CS 429 and CS 439.\n\n## How did you like the first lectures?\n\nI really enjoyed the first lectures. I like how professor Downing keeps us engaged in the class, truly allowing us to learn the content. I haven't had a class like this for a very long time.\n\n## How did you feel about the cold calling?\n\nI think it contributes to learning a lot. And when we all eventually are using these things learned in class, we will actually know them, allowing us to be better engineers.\n\n## What made you happy this week?\n\nI really enjoyed getting to race the Austin International Half Marathon with many of my friends this weekend. It was an overall downhill course and getting to race alongside some of my closest friends was awesome.\n\n## What's your pick-of-the-week or tip-of-the-week?\n\nI learned about the basics of C++ this week through professor Downings class, learned ostreams, istreams, and simple printing statements and getting input.",
    "tags": ["CS 371p", "UT Austin", "introduction"]
  },
  {
    "id": "cs-371p-week4",
    "title": "CS 371p Spring 2026: Week 4",
    "date": "2026-02-08",
    "excerpt": "Reflections on passing by reference, collaborative quizzes, and BFS implementation challenges in C++.",
    "content": "![On a cruise in Milford Sound, New Zealand](/milford-sound.JPG)\n\n## Which concept from this week surprised you, challenged you, or finally \"clicked\"?\n\nA concept that finally clicked was passing by reference. I thought that was a very interesting idea. Especially because passing by reference essentially allows another alias. Also, learning that exceptions are only done by passing by reference. It was also great getting to review how pointers are used. I haven't used pointers in a long time and forgot a lot of the usefulness of it. Lastly, learning the difference between the pointer and the actual value, how to make each one mutable or immutable, was a very good experience. I also really enjoyed Downing drilling this into our heads to make sure that we truly learned it.\n\n## How did the collaborative quizzes help you understand the material - or show you what you still need to work on?\n\nThe collaborative quizzes were pretty challenging this week. The little time that we are given really puts us under a time crunch and forces us to collaborate with others, or else we just won't finish. This really forces us to look through the notes again before coming to class.\n\n## Did the programming challenge change how you think about solving problems under pressure?\n\nI definitely think that the programming challenge allowed me to really think through problems that I traditionally would be able to do in an easier language like python. The problem this week required a BFS implementation. BFS in a language in python is not too complicated to do. Unfortunately, in C++ the implementation is much harder and requires a lot more thinking. For example, in python, you can just easily check if arrays have equivalent values by just using the \"==\" operator. But in a language like C++ you have to check through everything. I also feel a lot less familiar with the C++ paradigms still, but nothing is impossible with a little bit more practice and repetition.\n\n## Pick of the week?\n\nThis week I discovered that OpenAI with GPT5.2 recently brought OpenAI back to life after they were temporarily beaten by Gemini 3. It is interesting how much hype surrounds these very similar models. They all perform very similarly. I tried using both and an average computer scientist like me doesn't see a difference.",
    "tags": ["CS 371p", "UT Austin", "C++", "pointers", "references"]
  },
  {
    "id": "cs-371p-week6",
    "title": "CS 371p Spring 2026: Week 6",
    "date": "2026-02-22",
    "excerpt": "Iterator tags finally click, collaborative quizzes challenge understanding, and AI models continue their rapid evolution.",
    "content": "![On a cruise in Milford Sound, New Zealand](/milford-sound.JPG)\n\n## Which concept from this week surprised you, challenged you, or finally \"clicked\"?\n\nI really enjoyed this weeks content. There was a lot that we learned. Iterator_tags was one of the most confusing (at first) but also interesting things that i have ever learned. It was intriguing getting to learn that there are read/write/forward/bidirectional/random access iterators. Iterator tags hare super important for controlling how data is accessed and manipulated. This made me think more about design choices in programming.\n\nAs I spent more time with it and studied it for the quizzes, the concept started to make more sense. I put the theory to the test in real life circumstances and by the end of the week I am now confident in my ability to use it correctly in different situations.\n\nThe assignment, Voting, was also very interesting. It allowed me to put into practice what we learned in class. Learning about the voting process gave me a better understanding of how things could be implemented in the real world. The experience reinforced material learned in class.\n\n## How did the collaborative quizzes help you understand the material - or show you what you still need to work on?\n\nI think that the quizzes really challenged me and I benefited greatly from doing it alongside my peers. As always the quizzes fly. They go by super fast and we have to really know what we are doing on them in order to get a high score. They challenge me to look back on the notes to ensure that I am learning the material. Collaborating helped me learn what other peers might know better than me.\n\n## Was there a moment of discovery, frustration, or teamwork this week that stands out?\n\n## Pick of the week\n\nAgain new models have come out - Opus 4.6 and GPT 5.3 codex. These models are again beating the last models in their statistics, proving to be some of the most powerful tools that developers can use. I saw that GPT 5.3 codex can not only create a 3d game but a gokart game that has excellent graphics and depicts karts passing each other, keeping track of the placement of each car, laps, and other things. This is super impressive, especially knowing that euclidian graphics has its own class here at UT. The battle is just trying to beat the best current model, whether its gemini, Claude, OpenAI",
    "tags": ["CS 371p", "UT Austin", "C++", "iterators", "AI"]
  },
  {
    "id": "cs-371p-week7",
    "title": "CS 371p Spring 2026: Week 7",
    "date": "2026-03-01",
    "excerpt": "Implicit conversion clicks, allocate project challenges, and Anthropic's Pentagon controversy.",
    "content": "![On a cruise in Milford Sound, New Zealand](/milford-sound.JPG)\n\n## Which concept from this week surprised you, challenged you, or finally \"clicked\"?\n\nImplicit conversion which is something that we've been doing since the first day of class finally made sense, getting to see it in action with the constructor. But some things that were hard were learning about the allocate project. I am still a little confused on the main points of the project. It was confusing knowing how much memory was stored for sentinels and where the negative numbers were coming from? Hopefully it makes more sense as I start the project next week.\n\n## How did the collaborative quizzes help you understand the material - or show you what you still need to work on?\n\nThe quizzes were very important for learning the material and challenge me constantly. The constant time pressure really forced me to learn the content well. The implicit conversions vs explicit conversions were very interesting to learn about. Also, thank you professor Downing for the repeated quiz:).\n\n## Was there a moment of discovery, frustration, or teamwork this week that stands out?\n\nThe most frustrating part of this week was doing the programming problem - Eulerian graphs. It was a tough problem. At first glance the problem seems simple, its just a sequence of vertices. And you make sure its valid. You just would loop through but that is wrong. The detail that messes this all up is this sentence: the graph is allowed to contain multiple edges between the same pair of vertices, each of which must be passed once.\n\nNow we have to use a different approach which involves using a multiset.\n\n## Pick of the week\n\nThe pick of the week is with Anthropic and Pentagon. Anthropic (maker of claude) got blacklisted by the US government. Anthropic would be the first AI lab to deploy models in the Department of defenses classified network. The core dispute we whether these AI models would be used to kill humans and for mass surveillance. Anthropic \"in good conscience\" would not allow their models to be used in this way. They argued that the AI models are not reliable enough to be used in autonomous weapons. Honestly this was pretty valid, but the pentagon blacklisted them. Then later, Sam Altman CEO of openAI steps in and agreed to allow their models to be used. Very interesting. And very fearful for the world that we live in.",
    "tags": ["CS 371p", "UT Austin", "C++", "implicit conversion", "AI"]
  }
]
